---
type: APIObject
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# APIObject

`Autodesk.Revit.DB.APIObject` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsReadOnly | — | `public virtual bool IsReadOnly { get ; }` |